<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"42faf86d234ae859fa3c89bcb6a0fcb958228ba880910c5f309ba8311dbf5aad","plan_job_ref":"Job Create Terraform plan (DEV) #15 at https://github.com/AudioProthese/openrms-core-infrastructure/actions/runs/14670859009","plan_out_hash":"4e3b283caf03e56da93dcc96f04c333fc1f455954495d5662c8026b82b4fe92d","plan_hash":"762e36827b5bb986c24301b6ad50b3a926eb1791d227a40db243948aafa9e6a4","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __terraform/dev/__
With var files: `terraform/dev/dev.tfvars`
<details>
<summary>Plan: 28 to add, 0 to change, 6 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.app_gateway.azurerm_application_gateway.this will be created
+   resource "azurerm_application_gateway" "this" {
+       id                          = (known after apply)
+       location                    = "francecentral"
+       name                        = "openrmscore-dev-gw"
+       private_endpoint_connection = (known after apply)
+       resource_group_name         = "rg-openrmscore-dev"
+       tags                        = {
+           "environment" = "dev"
+           "project"     = "openrmscore"
        }

+       backend_address_pool {
+           fqdns        = [
+               null,
            ]
+           id           = (known after apply)
+           ip_addresses = (known after apply)
+           name         = "backendPool"
        }

+       backend_http_settings {
+           cookie_based_affinity               = "Disabled"
+           id                                  = (known after apply)
+           name                                = "httpSetting"
+           pick_host_name_from_backend_address = false
+           port                                = 80
+           probe_id                            = (known after apply)
+           protocol                            = "Http"
+           request_timeout                     = 60
+           trusted_root_certificate_names      = []
#            (4 unchanged attributes hidden)
        }

+       frontend_ip_configuration {
+           id                            = (known after apply)
+           name                          = "frontendIpConfig"
+           private_ip_address            = (known after apply)
+           private_ip_address_allocation = "Dynamic"
+           private_link_configuration_id = (known after apply)
+           public_ip_address_id          = (known after apply)
        }

+       frontend_port {
+           id   = (known after apply)
+           name = "frontendPort"
+           port = 80
        }

+       gateway_ip_configuration {
+           id        = (known after apply)
+           name      = "gatewayIpConfig"
+           subnet_id = (known after apply)
        }

+       http_listener {
+           frontend_ip_configuration_id   = (known after apply)
+           frontend_ip_configuration_name = "frontendIpConfig"
+           frontend_port_id               = (known after apply)
+           frontend_port_name             = "frontendPort"
+           host_names                     = []
+           id                             = (known after apply)
+           name                           = "httpListener"
+           protocol                       = "Http"
+           ssl_certificate_id             = (known after apply)
+           ssl_profile_id                 = (known after apply)
#            (4 unchanged attributes hidden)
        }

+       request_routing_rule {
+           backend_address_pool_id     = (known after apply)
+           backend_address_pool_name   = "backendPool"
+           backend_http_settings_id    = (known after apply)
+           backend_http_settings_name  = "httpSetting"
+           http_listener_id            = (known after apply)
+           http_listener_name          = "httpListener"
+           id                          = (known after apply)
+           name                        = "rule"
+           redirect_configuration_id   = (known after apply)
+           rewrite_rule_set_id         = (known after apply)
+           rule_type                   = "Basic"
+           url_path_map_id             = (known after apply)
#            (3 unchanged attributes hidden)
        }

+       sku {
+           capacity = 2
+           name     = "Standard_v2"
+           tier     = "Standard_v2"
        }

+       ssl_policy (known after apply)
    }

  # module.app_gateway.azurerm_public_ip.this will be created
+   resource "azurerm_public_ip" "this" {
+       allocation_method       = "Static"
+       ddos_protection_mode    = "VirtualNetworkInherited"
+       fqdn                    = (known after apply)
+       id                      = (known after apply)
+       idle_timeout_in_minutes = 4
+       ip_address              = (known after apply)
+       ip_version              = "IPv4"
+       location                = "francecentral"
+       name                    = "openrmscore-dev-gw-pip"
+       resource_group_name     = "rg-openrmscore-dev"
+       sku                     = "Standard"
+       sku_tier                = "Regional"
    }

  # module.container_app.azurerm_container_app.app will be created
+   resource "azurerm_container_app" "app" {
+       container_app_environment_id  = (known after apply)
+       custom_domain_verification_id = (sensitive value)
+       id                            = (known after apply)
+       latest_revision_fqdn          = (known after apply)
+       latest_revision_name          = (known after apply)
+       location                      = (known after apply)
+       name                          = "openrmscore-dev-app"
+       outbound_ip_addresses         = (known after apply)
+       resource_group_name           = "rg-openrmscore-dev"
+       revision_mode                 = "Single"
+       tags                          = {
+           "environment" = "dev"
+           "project"     = "openrmscore"
        }

+       identity {
+           identity_ids = (known after apply)
+           principal_id = (known after apply)
+           tenant_id    = (known after apply)
+           type         = "UserAssigned"
        }

+       ingress {
+           allow_insecure_connections = false
+           custom_domain              = (known after apply)
+           external_enabled           = false
+           fqdn                       = (known after apply)
+           target_port                = 8080
+           transport                  = "http"

+           traffic_weight {
+               latest_revision = true
+               percentage      = 100
            }
        }

+       registry {
+           identity = (known after apply)
+           server   = "openrmscoredevacr.azurecr.io"
        }

+       secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
+       secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
+       secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
+       secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
+       secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
+       secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
+       secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

+       template {
+           max_replicas                     = 5
+           min_replicas                     = 1
+           revision_suffix                  = (known after apply)
+           termination_grace_period_seconds = 0

+           container {
+               cpu               = 1
+               ephemeral_storage = (known after apply)
+               image             = "openrmscore-frontend"
+               memory            = "2Gi"
+               name              = "frontend"

+               env {
+                   name  = "API_URL"
+                   value = "/openmrs"
                }
+               env {
+                   name  = "SPA_CONFIG_URLS"
+                   value = "/openmrs/spa/config-core_demo.json"
                }
+               env {
+                   name  = "SPA_DEFAULT_LOCALE"
#                    (1 unchanged attribute hidden)
                }
+               env {
+                   name  = "SPA_PATH"
+                   value = "/openmrs/spa"
                }
            }
+           container {
+               cpu               = 1
+               ephemeral_storage = (known after apply)
+               image             = "openrmscore-backend:latest"
+               memory            = "2Gi"
+               name              = "backend"

+               env {
+                   name        = "OMRS_CONFIG_AUTO_UPDATE_DATABASE"
+                   secret_name = "OMRS-CONFIG-AUTO-UPDATE-DATABASE"
                }
+               env {
+                   name        = "OMRS_CONFIG_CONNECTION_DATABASE"
+                   secret_name = "OMRS-CONFIG-CONNECTION-DATABASE"
                }
+               env {
+                   name        = "OMRS_CONFIG_CONNECTION_PASSWORD"
+                   secret_name = "OMRS-CONFIG-CONNECTION-PASSWORD"
                }
+               env {
+                   name        = "OMRS_CONFIG_CONNECTION_SERVER"
+                   secret_name = "OMRS-CONFIG-CONNECTION-SERVER"
                }
+               env {
+                   name        = "OMRS_CONFIG_CONNECTION_USERNAME"
+                   secret_name = "OMRS-CONFIG-CONNECTION-USERNAME"
                }
+               env {
+                   name        = "OMRS_CONFIG_CREATE_TABLES"
+                   secret_name = "OMRS-CONFIG-CREATE-TABLES"
                }
+               env {
+                   name        = "OMRS_CONFIG_MODULE_WEB_ADMIN"
+                   secret_name = "OMRS-CONFIG-MODULE-WEB-ADMIN"
                }

+               volume_mounts {
+                   name = "openmrs-data"
+                   path = "/openmrs/data"
                }
            }
+           container {
+               cpu               = 1
+               ephemeral_storage = (known after apply)
+               image             = "openrmscore-gateway:latest"
+               memory            = "2Gi"
+               name              = "gateway"
            }

+           volume {
+               name         = "openmrs-data"
+               storage_name = "openrmscoredevstorage"
+               storage_type = "AzureFile"
            }
        }
    }

  # module.container_app.azurerm_container_app_environment.this will be created
+   resource "azurerm_container_app_environment" "this" {
+       custom_domain_verification_id    = (known after apply)
+       default_domain                   = (known after apply)
+       docker_bridge_cidr               = (known after apply)
+       id                               = (known after apply)
+       infrastructure_subnet_id         = (known after apply)
+       internal_load_balancer_enabled   = true
+       location                         = "francecentral"
+       log_analytics_workspace_id       = (known after apply)
+       logs_destination                 = "log-analytics"
+       mutual_tls_enabled               = false
+       name                             = "openrmscore-dev-env"
+       platform_reserved_cidr           = (known after apply)
+       platform_reserved_dns_ip_address = (known after apply)
+       resource_group_name              = "rg-openrmscore-dev"
+       static_ip_address                = (known after apply)
+       tags                             = {
+           "environment" = "dev"
+           "project"     = "openrmscore"
        }
+       zone_redundancy_enabled          = false
    }

  # module.container_uai.azurerm_role_assignment.this["acr-pull"] will be created
+   resource "azurerm_role_assignment" "this" {
+       condition_version                = (known after apply)
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = (known after apply)
+       principal_type                   = (known after apply)
+       role_definition_id               = (known after apply)
+       role_definition_name             = "AcrPull"
+       scope                            = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openrmscore-dev/providers/Microsoft.ContainerRegistry/registries/openrmscoredevacr"
+       skip_service_principal_aad_check = (known after apply)
    }

  # module.container_uai.azurerm_role_assignment.this["kv-secrets-read"] will be created
+   resource "azurerm_role_assignment" "this" {
+       condition_version                = (known after apply)
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = (known after apply)
+       principal_type                   = (known after apply)
+       role_definition_id               = (known after apply)
+       role_definition_name             = "Key Vault Secrets User"
+       scope                            = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openrmscore-dev/providers/Microsoft.KeyVault/vaults/openrmscore-dev-kv"
+       skip_service_principal_aad_check = (known after apply)
    }

  # module.container_uai.azurerm_user_assigned_identity.this will be created
+   resource "azurerm_user_assigned_identity" "this" {
+       client_id           = (known after apply)
+       id                  = (known after apply)
+       location            = "francecentral"
+       name                = "openrmscore-dev-uai"
+       principal_id        = (known after apply)
+       resource_group_name = "rg-openrmscore-dev"
+       tenant_id           = (known after apply)
    }

  # module.db.azurerm_mssql_database.this will be created
+   resource "azurerm_mssql_database" "this" {
+       auto_pause_delay_in_minutes                                = (known after apply)
+       collation                                                  = "SQL_Latin1_General_CP1_CI_AS"
+       create_mode                                                = "Default"
+       creation_source_database_id                                = (known after apply)
+       enclave_type                                               = (known after apply)
+       geo_backup_enabled                                         = true
+       id                                                         = (known after apply)
+       ledger_enabled                                             = (known after apply)
+       license_type                                               = "LicenseIncluded"
+       maintenance_configuration_name                             = (known after apply)
+       max_size_gb                                                = 4
+       min_capacity                                               = (known after apply)
+       name                                                       = "openrmsdb"
+       read_replica_count                                         = (known after apply)
+       read_scale                                                 = false
+       restore_point_in_time                                      = (known after apply)
+       sample_name                                                = (known after apply)
+       secondary_type                                             = (known after apply)
+       server_id                                                  = (known after apply)
+       sku_name                                                   = "Basic"
+       storage_account_type                                       = "Geo"
+       tags                                                       = {
+           "environment" = "dev"
+           "project"     = "openrmscore"
        }
+       transparent_data_encryption_enabled                        = true
+       transparent_data_encryption_key_automatic_rotation_enabled = false
+       zone_redundant                                             = false

+       long_term_retention_policy (known after apply)

+       short_term_retention_policy {
+           backup_interval_in_hours = (known after apply)
+           retention_days           = 7
        }

+       threat_detection_policy (known after apply)
    }

  # module.db.azurerm_mssql_server.this must be replaced
-/+ resource "azurerm_mssql_server" "this" {
-       administrator_login_password_wo_version      = 0 -> null
!~      fully_qualified_domain_name                  = "openrmscoredevsql.database.windows.net" -> (known after apply)
!~      id                                           = "***************************************************************************************************************************************" -> (known after apply)
!~      name                                         = "openrmscoredevsql" -> "openrmscore-dev-sql" # forces replacement
+       primary_user_assigned_identity_id            = (known after apply)
!~      public_network_access_enabled                = false -> true
!~      restorable_dropped_database_ids              = [] -> (known after apply)
        tags                                         = {
            "environment" = "dev"
            "project"     = "openrmscore"
        }
#        (10 unchanged attributes hidden)

!~      identity {
-           identity_ids = [] -> null
!~          principal_id = "************************************" -> (known after apply)
!~          tenant_id    = "************************************" -> (known after apply)
#            (1 unchanged attribute hidden)
        }
    }

  # module.keyvault.azurerm_role_assignment.data_plane["kv-admin"] will be created
+   resource "azurerm_role_assignment" "data_plane" {
+       condition_version                = (known after apply)
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = "************************************"
+       principal_type                   = (known after apply)
+       role_definition_id               = (known after apply)
+       role_definition_name             = "Key Vault Administrator"
+       scope                            = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openrmscore-dev/providers/Microsoft.KeyVault/vaults/openrmscore-dev-kv"
+       skip_service_principal_aad_check = (known after apply)
    }

  # module.keyvault.azurerm_role_assignment.data_plane["kv-secrets-officer"] will be created
+   resource "azurerm_role_assignment" "data_plane" {
+       condition_version                = (known after apply)
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = "************************************"
+       principal_type                   = (known after apply)
+       role_definition_id               = (known after apply)
+       role_definition_name             = "Key Vault Secrets Officer"
+       scope                            = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openrmscore-dev/providers/Microsoft.KeyVault/vaults/openrmscore-dev-kv"
+       skip_service_principal_aad_check = (known after apply)
    }

  # module.keyvault.azurerm_role_assignment.keyvault_admin will be destroyed
  # (because azurerm_role_assignment.keyvault_admin is not in configuration)
-   resource "azurerm_role_assignment" "keyvault_admin" {
-       id                                     = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openrmscore-dev/providers/Microsoft.KeyVault/vaults/openrmscore-dev-kv/providers/Microsoft.Authorization/roleAssignments/5f4e7c14-aa08-3f55-ca1b-9391d7941ea0" -> null
-       name                                   = "5f4e7c14-aa08-3f55-ca1b-9391d7941ea0" -> null
-       principal_id                           = "7039aa21-edae-48d2-932b-51c35303ff75" -> null
-       principal_type                         = "User" -> null
-       role_definition_id                     = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/providers/Microsoft.Authorization/roleDefinitions/00482a5a-887f-4fb3-b363-3b7fe8e74483" -> null
-       role_definition_name                   = "Key Vault Administrator" -> null
-       scope                                  = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openrmscore-dev/providers/Microsoft.KeyVault/vaults/openrmscore-dev-kv" -> null
#        (4 unchanged attributes hidden)
    }

  # module.keyvault.azurerm_role_assignment.service_principal will be destroyed
  # (because azurerm_role_assignment.service_principal is not in configuration)
-   resource "azurerm_role_assignment" "service_principal" {
-       id                                     = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openrmscore-dev/providers/Microsoft.KeyVault/vaults/openrmscore-dev-kv/providers/Microsoft.Authorization/roleAssignments/86f3a241-69cd-5997-fb2e-8e24283a0121" -> null
-       name                                   = "86f3a241-69cd-5997-fb2e-8e24283a0121" -> null
-       principal_id                           = "14bba8fe-c8f5-47cf-92bb-1dcd6911f4b3" -> null
-       principal_type                         = "ServicePrincipal" -> null
-       role_definition_id                     = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/providers/Microsoft.Authorization/roleDefinitions/b86a8fe4-44ce-4948-aee5-eccb2c155cd7" -> null
-       role_definition_name                   = "Key Vault Secrets Officer" -> null
-       scope                                  = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openrmscore-dev/providers/Microsoft.KeyVault/vaults/openrmscore-dev-kv" -> null
#        (4 unchanged attributes hidden)
    }

  # module.monitoring_storage.azurerm_log_analytics_workspace.logs will be created
+   resource "azurerm_log_analytics_workspace" "logs" {
+       allow_resource_only_permissions = true
+       daily_quota_gb                  = -1
+       id                              = (known after apply)
+       internet_ingestion_enabled      = true
+       internet_query_enabled          = true
+       local_authentication_disabled   = false
+       location                        = "francecentral"
+       name                            = "openrmscore-dev-logs"
+       primary_shared_key              = (sensitive value)
+       resource_group_name             = "rg-openrmscore-dev"
+       retention_in_days               = 30
+       secondary_shared_key            = (sensitive value)
+       sku                             = "PerGB2018"
+       tags                            = {
+           "environment" = "dev"
+           "project"     = "openrmscore"
        }
+       workspace_id                    = (known after apply)
    }

  # module.monitoring_storage.azurerm_storage_account.storage will be created
+   resource "azurerm_storage_account" "storage" {
+       access_tier                        = (known after apply)
+       account_kind                       = "StorageV2"
+       account_replication_type           = "LRS"
+       account_tier                       = "Standard"
+       allow_nested_items_to_be_public    = true
+       cross_tenant_replication_enabled   = false
+       default_to_oauth_authentication    = false
+       dns_endpoint_type                  = "Standard"
+       https_traffic_only_enabled         = true
+       id                                 = (known after apply)
+       infrastructure_encryption_enabled  = false
+       is_hns_enabled                     = false
+       large_file_share_enabled           = (known after apply)
+       local_user_enabled                 = true
+       location                           = "francecentral"
+       min_tls_version                    = "TLS1_2"
+       name                               = "openrmscoredevstorage"
+       nfsv3_enabled                      = false
+       primary_access_key                 = (sensitive value)
+       primary_blob_connection_string     = (sensitive value)
+       primary_blob_endpoint              = (known after apply)
+       primary_blob_host                  = (known after apply)
+       primary_blob_internet_endpoint     = (known after apply)
+       primary_blob_internet_host         = (known after apply)
+       primary_blob_microsoft_endpoint    = (known after apply)
+       primary_blob_microsoft_host        = (known after apply)
+       primary_connection_string          = (sensitive value)
+       primary_dfs_endpoint               = (known after apply)
+       primary_dfs_host                   = (known after apply)
+       primary_dfs_internet_endpoint      = (known after apply)
+       primary_dfs_internet_host          = (known after apply)
+       primary_dfs_microsoft_endpoint     = (known after apply)
+       primary_dfs_microsoft_host         = (known after apply)
+       primary_file_endpoint              = (known after apply)
+       primary_file_host                  = (known after apply)
+       primary_file_internet_endpoint     = (known after apply)
+       primary_file_internet_host         = (known after apply)
+       primary_file_microsoft_endpoint    = (known after apply)
+       primary_file_microsoft_host        = (known after apply)
+       primary_location                   = (known after apply)
+       primary_queue_endpoint             = (known after apply)
+       primary_queue_host                 = (known after apply)
+       primary_queue_microsoft_endpoint   = (known after apply)
+       primary_queue_microsoft_host       = (known after apply)
+       primary_table_endpoint             = (known after apply)
+       primary_table_host                 = (known after apply)
+       primary_table_microsoft_endpoint   = (known after apply)
+       primary_table_microsoft_host       = (known after apply)
+       primary_web_endpoint               = (known after apply)
+       primary_web_host                   = (known after apply)
+       primary_web_internet_endpoint      = (known after apply)
+       primary_web_internet_host          = (known after apply)
+       primary_web_microsoft_endpoint     = (known after apply)
+       primary_web_microsoft_host         = (known after apply)
+       public_network_access_enabled      = true
+       queue_encryption_key_type          = "*******"
+       resource_group_name                = "rg-openrmscore-dev"
+       secondary_access_key               = (sensitive value)
+       secondary_blob_connection_string   = (sensitive value)
+       secondary_blob_endpoint            = (known after apply)
+       secondary_blob_host                = (known after apply)
+       secondary_blob_internet_endpoint   = (known after apply)
+       secondary_blob_internet_host       = (known after apply)
+       secondary_blob_microsoft_endpoint  = (known after apply)
+       secondary_blob_microsoft_host      = (known after apply)
+       secondary_connection_string        = (sensitive value)
+       secondary_dfs_endpoint             = (known after apply)
+       secondary_dfs_host                 = (known after apply)
+       secondary_dfs_internet_endpoint    = (known after apply)
+       secondary_dfs_internet_host        = (known after apply)
+       secondary_dfs_microsoft_endpoint   = (known after apply)
+       secondary_dfs_microsoft_host       = (known after apply)
+       secondary_file_endpoint            = (known after apply)
+       secondary_file_host                = (known after apply)
+       secondary_file_internet_endpoint   = (known after apply)
+       secondary_file_internet_host       = (known after apply)
+       secondary_file_microsoft_endpoint  = (known after apply)
+       secondary_file_microsoft_host      = (known after apply)
+       secondary_location                 = (known after apply)
+       secondary_queue_endpoint           = (known after apply)
+       secondary_queue_host               = (known after apply)
+       secondary_queue_microsoft_endpoint = (known after apply)
+       secondary_queue_microsoft_host     = (known after apply)
+       secondary_table_endpoint           = (known after apply)
+       secondary_table_host               = (known after apply)
+       secondary_table_microsoft_endpoint = (known after apply)
+       secondary_table_microsoft_host     = (known after apply)
+       secondary_web_endpoint             = (known after apply)
+       secondary_web_host                 = (known after apply)
+       secondary_web_internet_endpoint    = (known after apply)
+       secondary_web_internet_host        = (known after apply)
+       secondary_web_microsoft_endpoint   = (known after apply)
+       secondary_web_microsoft_host       = (known after apply)
+       sftp_enabled                       = false
+       shared_access_key_enabled          = true
+       table_encryption_key_type          = "*******"
+       tags                               = {
+           "environment" = "dev"
+           "project"     = "openrmscore"
        }

+       blob_properties (known after apply)

+       network_rules (known after apply)

+       queue_properties (known after apply)

+       routing (known after apply)

+       share_properties (known after apply)

+       static_website (known after apply)
    }

  # module.monitoring_storage.azurerm_storage_share.openmrs_data will be created
+   resource "azurerm_storage_share" "openmrs_data" {
+       access_tier         = (known after apply)
+       enabled_protocol    = "SMB"
+       id                  = (known after apply)
+       metadata            = (known after apply)
+       name                = "openmrs-data"
+       quota               = 10
+       resource_manager_id = (known after apply)
+       storage_account_id  = (known after apply)
+       url                 = (known after apply)
    }

  # module.network.azurerm_network_security_group.nsg["aca"] will be destroyed
  # (because azurerm_network_security_group.nsg is not in configuration)
-   resource "azurerm_network_security_group" "nsg" {
-       id                  = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openrmscore-dev/providers/Microsoft.Network/networkSecurityGroups/openrmscore-dev-nsg-aca" -> null
-       location            = "francecentral" -> null
-       name                = "openrmscore-dev-nsg-aca" -> null
-       resource_group_name = "rg-openrmscore-dev" -> null
-       security_rule       = [
-           {
-               access                                     = "Allow"
-               destination_address_prefix                 = "*"
-               destination_address_prefixes               = []
-               destination_application_security_group_ids = []
-               destination_port_range                     = "*"
-               destination_port_ranges                    = []
-               direction                                  = "Inbound"
-               name                                       = "Allow-aca-Inbound"
-               priority                                   = 100
-               protocol                                   = "*"
-               source_address_prefix                      = "*"
-               source_address_prefixes                    = []
-               source_application_security_group_ids      = []
-               source_port_range                          = "*"
-               source_port_ranges                         = []
#                (1 unchanged attribute hidden)
            },
        ] -> null
-       tags                = {
-           "environment" = "dev"
-           "project"     = "openrmscore"
        } -> null
    }

  # module.network.azurerm_network_security_group.nsg["appgw"] will be destroyed
  # (because azurerm_network_security_group.nsg is not in configuration)
-   resource "azurerm_network_security_group" "nsg" {
-       id                  = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openrmscore-dev/providers/Microsoft.Network/networkSecurityGroups/openrmscore-dev-nsg-appgw" -> null
-       location            = "francecentral" -> null
-       name                = "openrmscore-dev-nsg-appgw" -> null
-       resource_group_name = "rg-openrmscore-dev" -> null
-       security_rule       = [
-           {
-               access                                     = "Allow"
-               destination_address_prefix                 = "*"
-               destination_address_prefixes               = []
-               destination_application_security_group_ids = []
-               destination_port_range                     = "*"
-               destination_port_ranges                    = []
-               direction                                  = "Inbound"
-               name                                       = "Allow-appgw-Inbound"
-               priority                                   = 100
-               protocol                                   = "*"
-               source_address_prefix                      = "*"
-               source_address_prefixes                    = []
-               source_application_security_group_ids      = []
-               source_port_range                          = "*"
-               source_port_ranges                         = []
#                (1 unchanged attribute hidden)
            },
        ] -> null
-       tags                = {
-           "environment" = "dev"
-           "project"     = "openrmscore"
        } -> null
    }

  # module.network.azurerm_network_security_group.this["aca"] will be created
+   resource "azurerm_network_security_group" "this" {
+       id                  = (known after apply)
+       location            = "francecentral"
+       name                = "openrmscore-dev-nsg-aca"
+       resource_group_name = "rg-openrmscore-dev"
+       security_rule       = [
+           {
+               access                                     = "Allow"
+               destination_address_prefix                 = "*"
+               destination_address_prefixes               = []
+               destination_application_security_group_ids = []
+               destination_port_range                     = "*"
+               destination_port_ranges                    = []
+               direction                                  = "Inbound"
+               name                                       = "AllowAllInbound"
+               priority                                   = 100
+               protocol                                   = "*"
+               source_address_prefix                      = "*"
+               source_address_prefixes                    = []
+               source_application_security_group_ids      = []
+               source_port_range                          = "*"
+               source_port_ranges                         = []
#                (1 unchanged attribute hidden)
            },
        ]
+       tags                = {
+           "environment" = "dev"
+           "project"     = "openrmscore"
        }
    }

  # module.network.azurerm_network_security_group.this["appgw"] will be created
+   resource "azurerm_network_security_group" "this" {
+       id                  = (known after apply)
+       location            = "francecentral"
+       name                = "openrmscore-dev-nsg-appgw"
+       resource_group_name = "rg-openrmscore-dev"
+       security_rule       = [
+           {
+               access                                     = "Allow"
+               destination_address_prefix                 = "*"
+               destination_address_prefixes               = []
+               destination_application_security_group_ids = []
+               destination_port_range                     = "*"
+               destination_port_ranges                    = []
+               direction                                  = "Inbound"
+               name                                       = "AllowAllInbound"
+               priority                                   = 100
+               protocol                                   = "*"
+               source_address_prefix                      = "*"
+               source_address_prefixes                    = []
+               source_application_security_group_ids      = []
+               source_port_range                          = "*"
+               source_port_ranges                         = []
#                (1 unchanged attribute hidden)
            },
        ]
+       tags                = {
+           "environment" = "dev"
+           "project"     = "openrmscore"
        }
    }

  # module.network.azurerm_subnet.this["aca"] will be created
+   resource "azurerm_subnet" "this" {
+       address_prefixes                              = [
+           "10.10.1.0/24",
        ]
+       default_outbound_access_enabled               = true
+       id                                            = (known after apply)
+       name                                          = "openrmscore-dev-aca"
+       private_endpoint_network_policies             = "Disabled"
+       private_link_service_network_policies_enabled = true
+       resource_group_name                           = "rg-openrmscore-dev"
+       virtual_network_name                          = "openrmscore-dev-vnet"

+       delegation {
+           name = "delegation-aca"

+           service_delegation {
+               actions = [
+                   "Microsoft.Network/virtualNetworks/subnets/action",
                ]
+               name    = "Microsoft.App/environments"
            }
        }
    }

  # module.network.azurerm_subnet.this["appgw"] will be created
+   resource "azurerm_subnet" "this" {
+       address_prefixes                              = [
+           "10.10.2.0/24",
        ]
+       default_outbound_access_enabled               = true
+       id                                            = (known after apply)
+       name                                          = "openrmscore-dev-appgw"
+       private_endpoint_network_policies             = "Disabled"
+       private_link_service_network_policies_enabled = true
+       resource_group_name                           = "rg-openrmscore-dev"
+       virtual_network_name                          = "openrmscore-dev-vnet"
    }

  # module.network.azurerm_subnet_network_security_group_association.this["aca"] will be created
+   resource "azurerm_subnet_network_security_group_association" "this" {
+       id                        = (known after apply)
+       network_security_group_id = (known after apply)
+       subnet_id                 = (known after apply)
    }

  # module.network.azurerm_subnet_network_security_group_association.this["appgw"] will be created
+   resource "azurerm_subnet_network_security_group_association" "this" {
+       id                        = (known after apply)
+       network_security_group_id = (known after apply)
+       subnet_id                 = (known after apply)
    }

  # module.network.azurerm_virtual_network.this will be created
+   resource "azurerm_virtual_network" "this" {
+       address_space                  = [
+           "10.10.0.0/16",
        ]
+       dns_servers                    = (known after apply)
+       guid                           = (known after apply)
+       id                             = (known after apply)
+       location                       = "francecentral"
+       name                           = "openrmscore-dev-vnet"
+       private_endpoint_vnet_policies = "Disabled"
+       resource_group_name            = "rg-openrmscore-dev"
+       subnet                         = (known after apply)
+       tags                           = {
+           "environment" = "dev"
+           "project"     = "openrmscore"
        }
    }

  # module.network.azurerm_virtual_network.vnet will be destroyed
  # (because azurerm_virtual_network.vnet is not in configuration)
-   resource "azurerm_virtual_network" "vnet" {
-       address_space                  = [
-           "10.10.0.0/16",
        ] -> null
-       dns_servers                    = [] -> null
-       flow_timeout_in_minutes        = 0 -> null
-       guid                           = "b61b2a86-7f70-498b-b686-b18b5da9ddbe" -> null
-       id                             = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openrmscore-dev/providers/Microsoft.Network/virtualNetworks/openrmscore-dev-vnet" -> null
-       location                       = "francecentral" -> null
-       name                           = "openrmscore-dev-vnet" -> null
-       private_endpoint_vnet_policies = "Disabled" -> null
-       resource_group_name            = "rg-openrmscore-dev" -> null
-       subnet                         = [
-           {
-               address_prefixes                              = [
-                   "10.10.1.0/24",
                ]
-               default_outbound_access_enabled               = true
-               delegation                                    = [
-                   {
-                       name               = "aca-delegation"
-                       service_delegation = [
-                           {
-                               actions = [
-                                   "Microsoft.Network/virtualNetworks/subnets/join/action",
                                ]
-                               name    = "Microsoft.App/environments"
                            },
                        ]
                    },
                ]
-               id                                            = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openrmscore-dev/providers/Microsoft.Network/virtualNetworks/openrmscore-dev-vnet/subnets/openrmscore-dev-aca"
-               name                                          = "openrmscore-dev-aca"
-               private_endpoint_network_policies             = "Disabled"
-               private_link_service_network_policies_enabled = true
-               service_endpoint_policy_ids                   = []
-               service_endpoints                             = []
#                (2 unchanged attributes hidden)
            },
-           {
-               address_prefixes                              = [
-                   "10.10.2.0/24",
                ]
-               default_outbound_access_enabled               = true
-               delegation                                    = []
-               id                                            = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openrmscore-dev/providers/Microsoft.Network/virtualNetworks/openrmscore-dev-vnet/subnets/openrmscore-dev-appgw"
-               name                                          = "openrmscore-dev-appgw"
-               private_endpoint_network_policies             = "Disabled"
-               private_link_service_network_policies_enabled = true
-               service_endpoint_policy_ids                   = []
-               service_endpoints                             = []
#                (2 unchanged attributes hidden)
            },
        ] -> null
-       tags                           = {
-           "environment" = "dev"
-           "project"     = "openrmscore"
        } -> null
#        (2 unchanged attributes hidden)
    }

  # module.omrs_secrets.azurerm_key_vault_secret.this["OMRS_CONFIG_AUTO_UPDATE_DATABASE"] will be created
+   resource "azurerm_key_vault_secret" "this" {
+       id                      = (known after apply)
+       key_vault_id            = "********************************************************************************************************************************************"
+       name                    = "OMRS-CONFIG-AUTO-UPDATE-DATABASE"
+       resource_id             = (known after apply)
+       resource_versionless_id = (known after apply)
+       value                   = (sensitive value)
+       value_wo                = (write-only attribute)
+       version                 = (known after apply)
+       versionless_id          = (known after apply)
    }

  # module.omrs_secrets.azurerm_key_vault_secret.this["OMRS_CONFIG_CONNECTION_DATABASE"] will be created
+   resource "azurerm_key_vault_secret" "this" {
+       id                      = (known after apply)
+       key_vault_id            = "********************************************************************************************************************************************"
+       name                    = "OMRS-CONFIG-CONNECTION-DATABASE"
+       resource_id             = (known after apply)
+       resource_versionless_id = (known after apply)
+       value                   = (sensitive value)
+       value_wo                = (write-only attribute)
+       version                 = (known after apply)
+       versionless_id          = (known after apply)
    }

  # module.omrs_secrets.azurerm_key_vault_secret.this["OMRS_CONFIG_CONNECTION_PASSWORD"] will be created
+   resource "azurerm_key_vault_secret" "this" {
+       id                      = (known after apply)
+       key_vault_id            = "********************************************************************************************************************************************"
+       name                    = "OMRS-CONFIG-CONNECTION-PASSWORD"
+       resource_id             = (known after apply)
+       resource_versionless_id = (known after apply)
+       value                   = (sensitive value)
+       value_wo                = (write-only attribute)
+       version                 = (known after apply)
+       versionless_id          = (known after apply)
    }

  # module.omrs_secrets.azurerm_key_vault_secret.this["OMRS_CONFIG_CONNECTION_SERVER"] will be created
+   resource "azurerm_key_vault_secret" "this" {
+       id                      = (known after apply)
+       key_vault_id            = "********************************************************************************************************************************************"
+       name                    = "OMRS-CONFIG-CONNECTION-SERVER"
+       resource_id             = (known after apply)
+       resource_versionless_id = (known after apply)
+       value                   = (sensitive value)
+       value_wo                = (write-only attribute)
+       version                 = (known after apply)
+       versionless_id          = (known after apply)
    }

  # module.omrs_secrets.azurerm_key_vault_secret.this["OMRS_CONFIG_CONNECTION_USERNAME"] will be created
+   resource "azurerm_key_vault_secret" "this" {
+       id                      = (known after apply)
+       key_vault_id            = "********************************************************************************************************************************************"
+       name                    = "OMRS-CONFIG-CONNECTION-USERNAME"
+       resource_id             = (known after apply)
+       resource_versionless_id = (known after apply)
+       value                   = (sensitive value)
+       value_wo                = (write-only attribute)
+       version                 = (known after apply)
+       versionless_id          = (known after apply)
    }

  # module.omrs_secrets.azurerm_key_vault_secret.this["OMRS_CONFIG_CREATE_TABLES"] will be created
+   resource "azurerm_key_vault_secret" "this" {
+       id                      = (known after apply)
+       key_vault_id            = "********************************************************************************************************************************************"
+       name                    = "OMRS-CONFIG-CREATE-TABLES"
+       resource_id             = (known after apply)
+       resource_versionless_id = (known after apply)
+       value                   = (sensitive value)
+       value_wo                = (write-only attribute)
+       version                 = (known after apply)
+       versionless_id          = (known after apply)
    }

  # module.omrs_secrets.azurerm_key_vault_secret.this["OMRS_CONFIG_MODULE_WEB_ADMIN"] will be created
+   resource "azurerm_key_vault_secret" "this" {
+       id                      = (known after apply)
+       key_vault_id            = "********************************************************************************************************************************************"
+       name                    = "OMRS-CONFIG-MODULE-WEB-ADMIN"
+       resource_id             = (known after apply)
+       resource_versionless_id = (known after apply)
+       value                   = (sensitive value)
+       value_wo                = (write-only attribute)
+       version                 = (known after apply)
+       versionless_id          = (known after apply)
    }

Plan: 28 to add, 0 to change, 6 to destroy.

Changes to Outputs:
+   app_gateway_public_ip = (known after apply)
```
</details>

:memo: Plan generated in [Create Terraform plan (DEV) #15](https://github.com/AudioProthese/openrms-core-infrastructure/actions/runs/14670859009)